[

    
    {
        "pergunta": "Na Grécia Antiga, a codificação das leis de Drácon (c. 620 a.C.) representou uma mudança crucial de qual aspecto?",
        "resposta": "Da execução individual para a responsabilidade governamental pela sua aplicação.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual filósofo romano expressou a ideia de que 'é a lei que governa... não o indivíduo que por acaso é o magistrado'?",
        "resposta": "Cícero",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Durante o 'vazio estatal' da Idade Média, qual instituição desempenhou um papel dominante na regulação da vida social e do direito?",
        "resposta": "A Igreja Romana.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Magna Carta (1215) é um documento fundamental por ter sido o primeiro a:",
        "resposta": "Incorporar a defesa do indivíduo contra o Estado e limitar o poder do soberano por escrito.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Apesar de sua importância, qual era uma das limitações do reconhecimento de direitos na Magna Carta?",
        "resposta": "Era restrito aos súditos ingleses e a estamentos sociais específicos.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Petição de Direito (1628) estabeleceu, entre outros, o princípio da proibição de tributação sem:",
        "resposta": "O consentimento parlamentar.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O Habeas Corpus Act de 1679 fortaleceu as garantias processuais para a liberdade individual ao:",
        "resposta": "Exigir que o preso fosse levado perante a autoridade judicial para exame da legalidade de sua detenção em curto prazo.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O Bill of Rights (1689), após a Revolução Gloriosa, consolidou qual aspecto na Inglaterra?",
        "resposta": "A supremacia do Parlamento sobre a Coroa, transformando o reino em uma monarquia constitucional.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual foi uma das características centrais do pensamento iluminista?",
        "resposta": "O primado da razão e a crença no progresso humano.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Para os teóricos contratualistas, como Hobbes, Locke e Rousseau, a origem do Estado reside em:",
        "resposta": "Um 'contrato social' entre indivíduos.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Thomas Hobbes, em 'O Leviatã', justificou qual forma de governo como necessária para garantir a ordem e a segurança?",
        "resposta": "Monarquias absolutistas.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "John Locke, considerado um pilar dos direitos humanos contemporâneos, argumentou que o principal dever do Estado é salvaguardar quais direitos naturais inalienáveis?",
        "resposta": "Vida, liberdade e propriedade.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Jean-Jacques Rousseau, em 'Do Contrato Social', argumentou que a soberania reside em:",
        "resposta": "O povo.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A teoria da separação de poderes, aprimorada por Montesquieu em 'O Espírito das Leis', visava principalmente a:",
        "resposta": "Prevenir o controle absoluto por um indivíduo ou grupo, preservando a liberdade.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Declaração de Independência dos Estados Unidos (1776) foi profundamente influenciada pela teoria dos direitos naturais de qual pensador?",
        "resposta": "John Locke.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Constituição dos Estados Unidos (1787) foi uma das primeiras 'propriamente ditas' no constitucionalismo moderno por contemplar:",
        "resposta": "Tanto a organização fundamental do Estado quanto os direitos humanos.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Declaração dos Direitos do Homem e do Cidadão (1789), da Revolução Francesa, proclamou qual princípio central em seu Artigo 1º?",
        "resposta": "'Os homens nascem e permanecem livres e iguais em direitos.'",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual era uma das principais características do Estado Liberal de Direito, que posteriormente levou à sua crise?",
        "resposta": "O individualismo e o abstencionismo estatal na economia (laissez-faire).",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "No Estado Liberal de Direito, como era visto o juiz no contexto do Positivismo Jurídico?",
        "resposta": "Como a 'boca da lei', com pouca liberdade interpretativa.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A crise do Estado Liberal de Direito foi impulsionada por qual fator principal?",
        "resposta": "As imensas injustiças e a intensa desigualdade socioeconômica.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Os direitos sociais, também conhecidos como direitos de segunda geração, estão relacionados a qual princípio?",
        "resposta": "Igualdade.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Quais foram as duas Constituições pioneiras a incorporar os direitos sociais, dedicando capítulos ao dever do Estado de provê-los?",
        "resposta": "Constituição do México (1917) e Constituição de Weimar (Alemanha, 1919).",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "No Estado Social de Direito, a legalidade administrativa passou de uma vinculação 'negativa' para uma vinculação 'positiva'. O que isso significava?",
        "resposta": "A Administração só podia fazer o que a lei permitia.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual foi uma das limitações do Estado Social de Direito, que levou à sua posterior superação?",
        "resposta": "A hipertrofia da esfera pública e o endividamento público.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O Estado Democrático de Direito é considerado um 'novo conceito' que supera os modelos Liberal e Social ao:",
        "resposta": "Agregar um componente revolucionário de transformação do status quo e consagrar novos direitos.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual é a base da soberania popular no Estado Democrático de Direito?",
        "resposta": "O poder emana do povo, que o exerce por meio de representantes eleitos ou diretamente.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "No Estado Democrático de Direito, a separação de poderes (Executivo, Legislativo e Judiciário) é considerada a melhor garantia para:",
        "resposta": "Preservar uma constituição democrática, liberal, pluralista e humanista.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Após a Segunda Guerra Mundial, qual modelo de constitucionalismo prevaleceu na maioria dos Estados democráticos?",
        "resposta": "A supremacia da Constituição, tal como interpretada por supremas cortes ou tribunais constitucionais.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A democracia consolidou-se no século XX com a consagração de qual princípio, superando restrições baseadas em renda, religião, raça e gênero?",
        "resposta": "Sufrágio universal.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O Artigo 1º da Constituição Federal de 1988 define a República Federativa do Brasil como um Estado Democrático de Direito, fundado em quais princípios, entre outros?",
        "resposta": "Soberania, cidadania e dignidade da pessoa humana.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual é um dos principais desafios práticos enfrentados pela participação popular no contexto brasileiro, apesar das garantias constitucionais?",
        "resposta": "A apatia política e a burocratização da participação.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A influência de interesses econômicos, religiosos e corporativos (lobbies) sobre os partidos políticos e as bancadas legislativas no Brasil é um problema que:",
        "resposta": "Fragiliza a democracia.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual é um dos maiores desafios contemporâneos ao Estado Democrático de Direito, que ameaça a proteção de minorias e os direitos fundamentais?",
        "resposta": "A ascensão de movimentos nacionalistas populistas e autoritários.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A teoria do reconhecimento, abordada no contexto dos desafios contemporâneos do EDD, busca reparar injustiças como:",
        "resposta": "A negação de direitos, exclusão social e desvalorização de estilos de vida.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A participação popular é considerada essencial para qual aspecto do poder no Estado Democrático de Direito?",
        "resposta": "A legitimidade.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual é a principal diferença entre a concepção de liberdade na Antiguidade e na concepção moderna, conforme o texto?",
        "resposta": "Na Antiguidade, liberdade era participação na vida social, pública e política; na concepção moderna, diz respeito ao livre arbítrio na vida privada.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O que a Lei das Doze Tábuas romana começou a limitar, sendo precursora dos sistemas de civil law modernos?",
        "resposta": "O autoritarismo estatal ao reconhecer direitos como propriedade e liberdade.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual foi a principal característica da ordem jurídica medieval, após a crise do Estado Romano?",
        "resposta": "A influência dominante da Igreja Romana e o direito fragmentado.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O que a Lex Regia romana representou em termos de 'Estado de Direito'?",
        "resposta": "Uma ficção legal que sancionava a ditadura, permitindo que 'a lei autorizasse a ilegalidade'.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual foi o principal objetivo da Revolução Americana (1776) em relação ao poder estatal?",
        "resposta": "Limitar o poder estatal e valorizar a liberdade individual.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Declaração dos Direitos do Homem e do Cidadão (1789) é descrita como abstrata e universalizante, sustentada por um tripé ideológico. Quais elementos constituíam esse tripé?",
        "resposta": "Intelectualismo, universalismo e individualismo.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual era a principal crítica ao Estado Liberal de Direito que levou à necessidade de intervenção estatal?",
        "resposta": "A geração de imensas injustiças e intensa desigualdade socioeconômica.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O que o termo 'social' no Estado Social de Direito se refere, em contraste com o individualismo liberal?",
        "resposta": "À correção do individualismo clássico liberal pela afirmação dos direitos sociais.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual foi uma das consequências da expansão das atribuições estatais no Estado Social de Direito?",
        "resposta": "A hipertrofia da esfera pública e a atrofia da privada.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "O que o pós-positivismo, que surgiu após a Segunda Guerra Mundial, buscou reintroduzir no direito?",
        "resposta": "Noções de ética e justiça.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "No Estado Democrático de Direito, a legalidade administrativa expandiu seu significado para incluir:",
        "resposta": "Todo o sistema jurídico (regras, princípios, objetivos).",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "Qual é o papel crucial das cortes constitucionais no Estado Democrático de Direito, especialmente diante da ascensão de movimentos populistas?",
        "resposta": "Proteger os direitos fundamentais e garantir a integridade do Estado Constitucional Democrático de Direito.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A Constituição Federal de 1988, no Brasil, é conhecida como a 'Constituição Cidadã' devido a qual característica?",
        "resposta": "Sua abrangente carta de direitos e garantias.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    },
    {
        "pergunta": "A desigualdade social é apontada como o 'arquitetura-inimigo da democracia social' no Brasil por qual motivo?",
        "resposta": "Dificulta a participação política efetiva da população mais vulnerável.",
        "tags": [
            "histórica democratica do estado democratico de direito"
        ]
    }
]